img = imread('cameraman.tif');
subplot(1,2,1)
imshow(img)

% applying the function which was mentioned in the problem
new_img = 255 - img;
subplot(1,2,2)
imshow(new_img)

% توضیح تمرین سوم:‌

% 1.	ابتدا عکس مورد نظر را میخوانیم (‌در اینجا  تصویر camera man در نظر گرفته شده)‌
% 2.	سپس با استفاده از یک تفریق ساده تمام نقاط عکس را از عدد ۲۵۵ کم میکنیم و نتیجه را نمایش میدهیم.
% 
% قابل ذکر است که بعد از اینکه هر پیکسل از عدد ۲۵۵ کم میشود حاصل مقدار مکمل ان پیکسل میشود. به عبارت دیگر در این برنامه پیکسل های سیاه با سفید جا به جا میشوند و همچنین برعکس.
